//============================================================================
// Name        : NOD_Evklid.cpp
// Author      : Учебник по Qt
// Version     :
// Copyright   : 
// Description : Для решения поставленной задачи воспользуемся алгоритмом Евклида: будем
// уменьшать каждый раз большее из чисел на величину меньшего до тех пор, пока
// оба значения не станут равными, так, как показано в таблице 3.2.
//============================================================================

#include <iostream>
using namespace std;

int main() {

	unsigned a, b;
	cout << "a = "; cin >> a;
	cout << "b = "; cin >> b;
	while(a != b) {
		if(a > b) a = a - b;
		else b = b - a;
	}
	cout << "НОД = " << a << endl;

	return 0;
}
